In [2]:
import pandas as pd
import numpy as np

## Reading from CSV

In [22]:
df = pd.read_csv("examples/ex1.csv") #Read from a csv file
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [24]:
pd.read_table('examples/ex1.csv', sep=',') #Spefify delimeter to read from csv

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [29]:
pd.read_csv('examples/ex2.csv',header = None) #Read in a file with no header

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [31]:
pd.read_csv("examples/ex2.csv", names = ["a","b","c","d","message"]) #Spefic header names

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [34]:
names = ["a","b","c","d","message"]
pd.read_csv("examples/ex2.csv", names = names, index_col = "message") #Set the message column to an index

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [37]:
pd.read_csv("examples/csv_mindex.csv")

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [40]:
pd.read_csv("examples/csv_mindex.csv", index_col  = ["key1", "key2"]) #Create heirarchal structure

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [42]:
list(open("examples/ex3.txt")) #txt file with values seperated with varying whitespace

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [45]:
pd.read_table("examples/ex3.txt", sep = "\s+") #Pass regular expression to seperate values

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [46]:
pd.read_csv("examples/ex4.csv")

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [49]:
pd.read_csv("examples/ex4.csv",skiprows = [0,2,3]) #Skips rows at specified indexes

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [51]:
result = pd.read_csv("examples/ex5.csv")
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [53]:
pd.isnull(result) #Check if values are null

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [55]:
result = pd.read_csv("examples/ex5.csv", na_values = ["NULL"]) #Consider missing values
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [57]:
#foo and NA become NaN in the message column and two becomes NaN in the something column
sentinels = {'message': ['foo', 'NA'], 'something': ['two']} 
pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

## Reading from Text Files in Pieces

In [59]:
pd.options.display.max_rows = 10 #Display only 10 rows max

In [61]:
result = pd.read_csv("examples/ex6.csv")
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [62]:
pd.read_csv('examples/ex6.csv', nrows=5) #Read a small number of rows

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [65]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000) #Read a file in pieces
chunker

In [77]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000) #Read the csv in chunks
tot = pd.Series([]) #Stores the count of each key

for piece in chunker:
    tot = tot.add(piece["key"].value_counts(), fill_value = 0) #Updates the count of each key

tot = tot.sort_values(ascending=False) #Sort in descending order
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

## Writing Data to Text Format

In [4]:
data = pd.read_csv("examples/ex5.csv")
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [5]:
data.to_csv("examples/out.csv")  #Write the data to a csv file

In [6]:
pd.read_csv("examples/out.csv")

   Unnamed: 0 something  a   b     c   d message
0           0       one  1   2   3.0   4     NaN
1           1       two  5   6   NaN   8   world
2           2     three  9  10  11.0  12     foo

In [14]:
dates  = pd.date_range("1/1/2000", periods = 7) #Generate dates from 1/1/2000 onwards 7 times
ts = pd.Series(np.arange(7), index = dates) #Create a series to hold numbers against dates
ts.to_csv("examples/tseries.csv", header= True)

In [15]:
pd.read_csv("examples/tseries.csv")

   Unnamed: 0  0
0  2000-01-01  0
1  2000-01-02  1
2  2000-01-03  2
3  2000-01-04  3
4  2000-01-05  4
5  2000-01-06  5
6  2000-01-07  6

## Working with Delimeted Formats

In [18]:
import csv
f = open("examples/ex7.csv") #Open a csv using a python built in function
reader = csv.reader(f) #Read all of the files
for line in reader:
    print(line) #Print each line of the file

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [20]:
with open("examples/ex7.csv") as f:
    lines = list(csv.reader(f)) #Read the file into a list of lines
header,values = lines[0], lines[1:] #Create header and values 
data_dict = {h: v for h,v in zip(header, zip(*values))} #'Create a dictionary of data columns'
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [25]:
class my_dialect(csv.Dialect): #Class to define a new format
    lineterminator = '\n' #When there is a new line
    delimiter = ';' #Seperate fields
    quotechar = '"' #Fields with special characters
    quoting = csv.QUOTE_MINIMAL #Quoting convention

f = open("examples/ex7.csv")    
reader = csv.reader(f, dialect=my_dialect) #Read the file using a new format
for line in reader:
    print(line)

['a,"b","c"']
['1,"2","3"']
['1,"2","3"']

## JSON Data

In [26]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
 {"name": "Katie", "age": 38,
 "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [29]:
import json
result = json.loads(obj) #Reads json string to python format
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [31]:
asjason = json.dumps(result) #Converts a python object back into a json
asjason

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [36]:
siblings = pd.DataFrame(result['siblings'], columns = ["name", "age"]) #Convert json to DataFrame
siblings

    name  age
0  Scott   30
1  Katie   38

In [37]:
data = pd.read_json('examples/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [38]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [39]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

## Web Scraping

In [40]:
tables = pd.read_html("examples/fdic_failed_bank_list.html") #Read HTML code
len(tables)

1

In [44]:
failures = tables[0]
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [49]:
close_timestamps = pd.to_datetime(failures['Closing Date']) #Convert all the closing dates to date times
close_timestamps.dt.year.value_counts() #Count the number of closing banks per year

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

In [55]:
from lxml import objectify
path = 'datasets/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path)) #parse XML file
root = parsed.getroot() #Get referent to the root node

In [58]:
data = [] #Hold dictionaries of tages and data

skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ','DESIRED_CHANGE', 'DECIMAL_PLACES'] #Fields not to include

for elt in root.INDICATOR: # for each <INDICATOR>
    el_data = {} # Dictionary to hold tag and data
    for child in elt.getchildren():
        if child.tag in skip_fields: #Dont include in data
            continue
        el_data[child.tag] = child.pyval #Add to dictionary if not in skip_fields
    data.append(el_data) #Add dictionary to list

perf = pd.DataFrame(data) #Convert list of dictionaries into a DataFrame
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95,96.9,95,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95,96,95,95
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95,96.3,95,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95,96.8,95,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95,96.6,95,95.8

In [59]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>' #HTML tag 
root = objectify.parse(StringIO(tag)).getroot()

In [60]:
root

In [61]:
root.get("href") #Access href

'http://www.google.com'

In [63]:
root.text #Access text

'Google'

## Binary Data Formats

In [64]:
frame = pd.read_csv("examples/ex1.csv")
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [66]:
frame.to_pickle("examples/frame_pickle") #Store the DataFrame in pickle format
pd.read_pickle("examples/frame_pickle") #Read the pickle format

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [68]:
frame = pd.DataFrame({'a': np.random.randn(100)})
store = pd.HDFStore("mydata.h5") #Store as HDF5 format
store["obj1"] = frame #Stores frame in obj1
store['obj1_col'] = frame["a"] #stores the values of frame in obj1_col
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [71]:
store['obj1']

           a
0  -0.472517
1  -0.229482
2   1.316060
3   1.093868
4   0.672607
..       ...
95 -1.264285
96 -1.843143
97 -0.530723
98 -0.083175
99 -0.096340

[100 rows x 1 columns]

In [73]:
store.put('obj2', frame, format='table') #Store as table
store.select("obj2", where = ["index >=10 and index <= 15"]) #Query the data

           a
10  0.580447
11  1.023516
12 -0.349042
13 -0.684846
14 -0.939064
15 -0.434134

In [74]:
store.close()

## Excel Files

In [78]:
xlsx = pd.ExcelFile("examples/ex1.xlsx")  #Create an instance of the excel file
pd.read_excel(xlsx, "Sheet1") #Read an individual sheet from the excel file

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [80]:
frame = pd.read_excel("examples/ex1.xlsx","Sheet1")
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [83]:
writer = pd.ExcelWriter("examples/ex2.xlsx") #Create an excel writer
frame.to_excel(writer,"Sheet1") #Write data to the writer
writer.save() #Store the writer

In [84]:
pd.read_excel("examples/ex2.xlsx")

   Unnamed: 0  Unnamed: 0.1  a   b   c   d message
0           0             0  1   2   3   4   hello
1           1             1  5   6   7   8   world
2           2             2  9  10  11  12     foo

In [85]:
frame.to_excel("examples/ex2.xlsx") #Pass straight to excel format

## Interacting with Web APIs

In [86]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url) #Send request to the URL
resp

In [89]:
data = resp.json() #Retrivee json in python format as a dictionary
data[1]["title"]

'TYP return type of DataFrame.clip not correct'

In [93]:
#Convert data dictionary to DataFrame
issues = pd.DataFrame(data, columns= ["number","title","labels", "state"])
issues.head()

,number,title,labels,state
0,40830,BUG: pandas.read_fwf does not throw warning or...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
1,40829,TYP return type of DataFrame.clip not correct,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
2,40828,DOC: Wrong URL in web/README.md,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
3,40827,BUG: Unexpected behavior when assigning multi-...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
4,40826,STYLE pandas-dev flake8 plugin,"[{'id': 219960758, 'node_id': 'MDU6TGFiZWwyMTk...",open

## Interacting with DataBases

In [100]:
import sqlite3
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
c REAL, d INTEGER
);"""
con = sqlite3.connect("mydata1.sqlite")
con.execute(query) #Create SQLite database

In [101]:
con.commit()

In [102]:
data = [('Atlanta', 'Georgia', 1.25, 6), ('Tallahassee', 'Florida', 2.6, 3), ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data) #Add data 
con.commit()

In [104]:
cursor = con.execute("select * from test") #Execute Query
rows = cursor.fetchall() #Select all the data
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [107]:
cursor.description #Column Names

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [108]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description]) #Create DataFrame to hold database data

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [112]:
import sqlalchemy as sqla

db = sqla.create_engine("sqlite:///mydata1.sqlite") #Connect to sqlite database with sqlalchemy

pd.read_sql("select * from test", db) #Read data from the database

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5